/************************************************************************************/
/** \file Beacon.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Boost For GT96
/** \Description 这个头文件为系统顶层逻辑模块的声明文件。该模块声明了脉冲信标闪的处理模块
相关的初始化和逻辑处理函数。

**	History: Initial Release
**	
/************************************************************************************/
#ifndef _Beacon_
#define _Beacon_
/************************************************************************************/
/* Extern Function definition - Initialization
*************************************************************************************/
void BeaconFSM_Reset(void); 

/************************************************************************************/
/* Extern Function definition - Timing and logic handler
*************************************************************************************/
void BeaconFSM_TIMHandler(void); //关闭时间计时
char BeaconFSM(void); //信标模式状态机

#endif /* _Beacon_ */

/*********************************  End Of File  ************************************/
