/************************************************************************************/
/** \file Sleep.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Boost For GT96
/** \Description 这个头文件为系统的顶层逻辑声明文件。该文件声明了负责实现系统超低静态电流
睡眠功能的逻辑处理函数，以及重置睡眠定时器的功能。
**	History: Initial Release
**	
/*************************************************************************************/
#ifndef _Sleep_
#define _Sleep_
/*************************************************************************************/
/*	  	Extern Functions definition - Sleep Logic Handler
**************************************************************************************/	
void SleepMgmt(void);

/*************************************************************************************/
/*	  	Extern Functions definition - Reset Sleep Down Counter
**************************************************************************************/	
void ResetSleepTimer(void);

#endif /* _Sleep_ */

/*********************************  End Of File  ************************************/
