/************************************************************************************/
/** \file SOS.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Boost For GT96
/** \Description 这个头文件为系统顶层逻辑模块的声明文件。该模块声明了SOS处理模块相关的初
始化和逻辑处理函数。

**	History: Initial Release
**	
/************************************************************************************/
#ifndef _SOS_
#define _SOS_
/************************************************************************************/
/* Extern Function definition - Initialization
*************************************************************************************/
void ResetSOSModule(void);	//复位整个SOS模块

/************************************************************************************/
/* Extern Function definition - SOS Logic Handler
*************************************************************************************/
char SOSFSM(void);					//SOS状态机处理模块
void SOSTIMHandler(void);		//SOS状态机的计时处理

	
#endif /* _SOS_ */

/*********************************  End Of File  ************************************/
