/************************************************************************************/
/** \file stdbool.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Boost For GT96
/** \Description 这个头文件采用CX51编译器支持的enum类型对编译器不支持的bool类型进行声明
								 以允许程序内使用bool变量。
**	History: Initial Release
**	
/************************************************************************************/
#ifndef _STBOOL_
#define _STBOOL_
/*************************************************************************************/
/*	Global type definitions('typedef')
**************************************************************************************/
typedef enum
	{
	false=0,
	true=1
	}bool;
	
#endif /* _STBOOL_ */

/*********************************  End Of File  ************************************/
