/************************************************************************************/
/** \file delay.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Boost For GT96
/** \Description 这个头文件为系统计时模块外部声明文件，负责为系统提供心跳定时器的控制函数
并提供各种心跳计时以及高低频率爆闪的Flag。

**	History: Initial Release
**	
/************************************************************************************/
#ifndef Delay
#define Delay
/************************************************************************************/
/* Extern Flags and Variable definition */
/************************************************************************************/

extern volatile bit SysHFBitFlag; //高频心跳Flag(每62.5mS置1)
extern volatile bit LFStrobeFlag; //低频爆闪Flag(125mS)
extern volatile bit StrobeFlag; //高频爆闪Flag(62.5mS交替切换)

/************************************************************************************/
/* Extern Functions definition */
/************************************************************************************/

void StartSystemTimeBase(void); //启动心跳定时器
void delay_ms(int ms);					//阻塞延时

/************************************************************************************/
/* Extern Fast Operation Macro definition */
/************************************************************************************/

//禁用系统心跳定时器，直接关闭定时器并除能中断
#define DisableSysHBTIM() do{T2CON=0x00;IE&=~0x20;}while(0) 

#endif /* Delay */

/*********************************  End Of File  ************************************/
